text = '''Роулинг: Гарри Поттер и узник Азкабана, Гарри Поттер и философский камень
          Хемингуэй: Старик и море, По ком звонит колокол
          Кинг: Зеленая миля, Оно '''
print("Авторы: Роулинг, Хэмингуэй, Кинг")
dct = {}
for line in text.splitlines():
    key, val = line.split(': ')
    dct[key] = val.split(', ')
print(dct[input()])
name = input()

if name == "Гарри Поттер и узник Азкабана":
    print("Из тюрьмы сбежал маг-преступник, считавшийся предателем. Его наказали за убийство родителей мальчика-волшебника. Мальчик выяснил, что маг невиновен, и с помощью магии нашёл настоящего преступника.")
if name == "Зеленая миля":
    print("США, 1932 год. Негр, осуждённый на смертную казнь за совершённое другим убийство, обладает даром исцеления. Он излечивает от рака жену начальника тюрьмы, но это не избавляет его от казни.")
if name == "Старик и море":
    print("Повесть «Старик и море» Хемингуэя была впервые опубликована в 1952 году. Произведение повествует об эпизоде из жизни старого кубинского рыбака, который боролся в открытом море с огромным марлином, ставшим его самой большой добычей в жизни. «Старик и море» является последним известным произведением, вышедшим при жизни писателя. Повесть была отмечена Пулитцеровской и Нобелевской премиями.")
if name == "Гарри Поттер и философский камень":
    print("Отважный мальчик-волшебник противостоит тёмному магу, убийце своих родителей, и прилагает все усилия, чтобы философский камень не достался злодею: смерть родителей не должна быть напрасной.")
if name == "По ком звонит колокол":
    print("Роман «По ком звонит колокол» Хемингуэя написан в 1940 году. Это книга об одном из самых драматичных периодов в истории Испании, когда в стране шла гражданская война.")
if name == "Оно":
    print("Семеро друзей вступают в противоборство с потусторонней тварью, которая питается детскими страхами, но уничтожить её им не удаётся. Повзрослев, друзья вновь сталкиваются с тварью и уничтожают её.")
